{
  "points": [
    {
      "id": "0",
      "name": "Test",
      "desc": "Test Description",
      "conjugation": "Test Conjugation",
      "sentences": [
        {
          "jp": "Test JP",
          "eg": "Test EG"
        },
        {
          "jp": "",
          "eg": ""
        },
        {
          "jp": "",
          "eg": ""
        },
        {
          "jp": "",
          "eg": ""
        }
      ]
    },

    {
      "id": "1",
      "name": "合う",
      "desc": "A suffix verb that follows the conjugated form of another verb. This verb means to do an action with another individual and requires involvement from both parties. It can be used in cooperation (助け合う “to help each other”) or in opposition (言い合う “to argue”).",
      "conjugation": "Verb[Stem]＋あう<br/>(A)＋合う (“To do (A) together/To do (A) for our benefit”)",
      "sentences": [
        {
          "jp": "こういう時こそ、助け<span class='warning-text'>合う</span>のが大切だね。",
          "eg": "At times like this, it’s important to help each other out."
        },
        {
          "jp": "二人はいつも言い<span class='warning-text'>合って</span>いますね。のが大切だね。",
          "eg": "Those two are always arguing aren’t they?"
        },
        {
          "jp": "隣の人と相談し<span class='warning-text'>合って</span>答えを考えてください。",
          "eg": "Consult with the person beside you and think about the answer."
        },
        {
          "jp": "自分の写真を見せ<span class='warning-text'>合い</span>ましょう。",
          "eg": "Let’s show each other our pictures!"
        }
      ]
    },

    {
      "id": "2",
      "name": "いくら・どんなに～ても",
      "desc": "An adverb that states that no matter how many times something occurs or how much of it occurs, it will not change the outcome. Though it often carries a negative connotation, it can be used for positive situations. いくら and どんなに can be used interchangeably.",
      "conjugation": "いくら＋Noun＋でも<br/>いくら＋Verb[て-Form]＋も<br/>いくら＋な-Adjective＋でも<br/>いくら＋Adjective[くて]＋も<br/>いくら・どんなに(A)でも(B) (“No matter how much (A), (B)”)",
      "sentences": [
        {
          "jp": "<span class='warning-text'>いくら</span>頑張っ<span class='warning-text'>ても</span>、彼にはかなわない。",
          "eg": "No matter how hard I try, I can’t compete with him."
        },
        {
          "jp": "<span class='warning-text'>どんなに</span>辛く<span class='warning-text'>ても</span>、泣かないよ！",
          "eg": "Don’t cry no matter how hard it is!"
        },
        {
          "jp": "<span class='warning-text'>いくら</span>ミス<span class='warning-text'>でも</span>、会社は彼を首にしません。",
          "eg": "It doesn't matter how many mistakes there are, the company won’t fire him."
        },
        {
          "jp": "<span class='warning-text'>どんなに</span>便利<span class='warning-text'>でも</span>、このソフトを使わない。",
          "eg": "No matter how convenient this software is, I’m not using it."
        }
      ]
    },

    {
      "id": "3",
      "name": "一方だ",
      "desc": "A noun that comes after a verb that expresses a situation that is progressing in a certain direction. <br/>That direction can be positive, negative, or neutral, but it is a continuing direction.",
      "conjugation": "Verb＋いっぽうだ<br/>(A)いっぽうだ (“It is continuing to (A)”)",
      "sentences": [
        {
          "jp": "日本の物価は高くなる<span class='warning-text'>一方だ</span>。",
          "eg": "The cost of living in Japan keeps rising."
        },
        {
          "jp": "全然運動していないため、体力は衰える<span class='warning-text'>一方だ</span>。",
          "eg": "Since I’m not exercising at all, my physical strength is steadily declining."
        },
        {
          "jp": "残念ながらこんな事件が増える<span class='warning-text'>一方だ</span>。",
          "eg": "Unfortunately, there are more and more cases like these."
        },
        {
          "jp": "高齢化が進んで、人口が減る<span class='warning-text'>一方だ</span>。",
          "eg": "Because of the aging society, the population continues to decline."
        }
      ]
    },

    {
      "id": "4",
      "name": "上に",
      "desc": "A grammar pattern that acts as a formal way of saying ‘and’ or ‘in addition to’.<br/>The sentence that comes after this pattern serves as additional information to the previous sentence. <br/>This pattern can be used for good, bad, or neutral situations.",
      "conjugation": "Noun＋[の・である]＋うえに<br/>Verb＋うえに<br/>な-Adjective＋[な・である]＋うえに<br/>い-Adjective＋うえに",
      "sentences": [
        {
          "jp": "ここの料理は美味しい<span class='warning-text'>上に</span>安い。",
          "eg": "The food here is tasty and it’s cheap too."
        },
        {
          "jp": "今日は寒い<span class='warning-text'>上に</span>風が強い。",
          "eg": "Today is cold, and on top of that, the wind is strong."
        },
        {
          "jp": "この病は治る可能性は低い<span class='warning-text'>上に</span>、治療費も高額だ。",
          "eg": "This illness has a low likelihood of being cured, and the treatment costs are high."
        },
        {
          "jp": "ケントさんは新聞記者である<span class='warning-text'>上に</span>スーパーヒーローでもあった。",
          "eg": "Kent-san was a newspaper reporter as well as a superhero."
        }
      ]
    },

    {
      "id": "5",
      "name": "として",
      "desc": "A particle that shows that the noun this structure is attached to is the standpoint from which the rest of the sentence is viewed from. This standpoint is based on qualities such as one’s position or qualifications.",
      "conjugation": "Noun＋として<br/>Noun＋として＋Noun",
      "sentences": [
        {
          "jp": "留学生<span class='warning-text'>として</span>日本へ来ました。",
          "eg": "I came to Japan as an international student."
        },
        {
          "jp": "けいじは友達<span class='warning-text'>として</span>はいい人なんだけど、ルームメイトとしてはよくない。",
          "eg": "Keiji is a nice person as a friend, but not as a roommate."
        },
        {
          "jp": "東京タワーは東京の観光地<span class='warning-text'>として</span>有名だ。",
          "eg": "Tokyo Tower is famous as a tourist attraction in Tokyo."
        },
        {
          "jp": "この考えはアイデア<span class='warning-text'>として</span>はいいが、コストや開発期間を考えると難しいと思う。",
          "eg": "This idea is good as a concept, but considering the cost and development time, I think it’s difficult."
        }
      ]
    },

    {
      "id": "6",
      "name": "における・において",
      "desc": "A combination of に and おける that is translated as ‘at’ or ‘in’.</br>It has the same meaning of で but is used in formal writing like news articles.",
      "conjugation": "Noun＋において<br/>Noun＋における＋Noun",
      "sentences": [
        {
          "jp": "車内<span class='warning-text'>における</span>携帯電話のご利用はご遠慮ください。",
          "eg": "Please refrain from using mobile phones inside the car."
        },
        {
          "jp": "2020年のオリンピックは東京<span class='warning-text'>において</span>行われました。",
          "eg": "The 2020 Olympics were held in Tokyo."
        },
        {
          "jp": "海外<span class='warning-text'>において</span>日本酒の需要が高まっている。",
          "eg": "The demand for Japanese sake overseas is rising."
        },
        {
          "jp": "日本<span class='warning-text'>における</span>英語教育は依然として、問題だらけです。",
          "eg": "English education in Japan is still full of problems."
        }
      ]
    }
  ]
}
